AriaSignature-Cfe/Catalogs/АС_КомпьютерыAria.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_КомпьютерыAria</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_КонтрагентыAria</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AriaSignature-Cfe/Catalogs/АС_КомпьютерыAria/Ext/ObjectModule.bsl
//+ BAS 24.05.2026 : Значения по умолчанию и обязательность реквизитов
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтоНовый() Тогда
		Активен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписью(Отказ)
	НезаполненныеПоля = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		НезаполненныеПоля.Добавить("Наименование");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяПК) Тогда
		НезаполненныеПоля.Добавить("ИмяПК");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КонтрагентПК) Тогда
		НезаполненныеПоля.Добавить("КонтрагентПК");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(IPУстройства) Тогда
		НезаполненныеПоля.Добавить("IPУстройства");
	КонецЕсли;
	
	Если НезаполненныеПоля.Количество() > 0 Тогда
		Отказ = Истина;
		Сообщить("Не заполнены обязательные реквизиты: " + СтрСоединить(НезаполненныеПоля, ", "));
	КонецЕсли;
КонецПроцедуры
//- BAS 24.05.2026 : Значения по умолчанию и обязательность реквизитов
